<template>
  <div class="map">
    <div class="warn">平台高峰预警信息(2条)</div>
    <div class="tour">景 区 实 时 客 流 量</div>
    <div class="echartsMap" ref="map"></div>
  </div>
</template>

<script setup lang="ts">
import { ref, onMounted } from "vue";
import * as echarts from "echarts";
// 引入中国地图JSON数据，数据文件来源：https://datav.aliyun.com/portal/school/atlas/area_selector
import chinaJSON from "./china.json";
let map = ref();
echarts.registerMap("china", chinaJSON as any);
let mycharts;
onMounted(() => {
  mycharts = echarts.init(map.value);
  mycharts.setOption({
    geo: {
      map: "china",
      // roam: true, //鼠标滚轮缩放拖动功能
      zoom: 1.5, //缩放比例
      // 地图位置调试
      // left:0,
      top: 200,
      // right:0,
      // bottom:0,
      label: {
        show: true, //地名字体显示
        color: "white",
        fontSize: "14px",
      },
      itemStyle: {
        color: {
          type: "linear",
          x: 0,
          y: 0,
          x2: 0,
          y2: 1,
          // x,y指渐变起点坐标，x2,y2是终点坐标
          colorStops: [
            {
              offset: 0,
              color: "#013b85",
            },
            {
              offset: 1,
              color: "#001e43",
            },
          ],
          global: false,
        },
        borderColor: "#245e9f",
        borderWidth: 2,
        shadowColor: "#2b5dc0",
        // shadowColor: "#1f4593",
        shadowBlur: 40,
        // shadowOffsetX: 1,
        // shadowOffsetY: 1,
        opacity: 0.8,
      },
      emphasis: {
        // disabled: false,
        // 地图高亮效果：鼠标移动到的位置亮起
        itemStyle: {
          // color: "#3775ed",
          color: {
            type: "linear",
            x: 0,
            y: 0,
            x2: 0,
            y2: 1,
            // x,y指渐变起点坐标，x2,y2是终点坐标
            colorStops: [
              {
                offset: 0,
                color: "#044182",
              },
              {
                offset: 1,
                color: "#2d7bac",
              },
            ],
            global: false,
          },
        },
        label: {
          fontSize: "25px",
        },
      },
    },
    series: [
      {
        type: "lines", //航线系列
        data: [
          {
            coords: [
              [116.405285, 39.904989], //起点
              [117.000923, 36.675807], //终点
            ],
            // 航线样式
            lineStyle: {
              color: "white",
              width: 2,
            },
          },
          {
            coords: [
              [113.280637, 23.125178], //起点
              [117.283042, 31.86119], //终点
            ],
          },
          {
            coords: [
              [113.280637, 23.125178], //起点
              [104.065735, 30.659462], //终点
            ],
          },
          {
            coords: [
              [104.065735, 30.659462], //起点
              [112.549248, 37.857014], //终点
            ],
          },
        ],
        // 动画特效
        effect: {
          show: true,
          // 可使用svg，这里是阿里找的svg图标
          symbol:
            "path://M995.679767 658.818049c-8.943231-1.490539-23.848617-2.981077-44.716157-4.471615-73.03639-8.943231-207.184862-26.829694-295.126638-38.754003l-19.377001-5.962154h-2.981077l-44.716157-13.414848c-4.471616 90.922853-10.43377 166.94032-17.886463 225.071325v10.43377l22.358078 10.43377 70.055313 32.791849c2.981077 1.490539 4.471616 4.471616 4.471616 7.452693l1.490539 55.149927v4.471615c0 2.981077-1.490539 5.962154-4.471616 4.471616l-114.77147-19.377001c-8.943231 22.358079-17.886463 34.282387-31.30131 35.772925h-1.490539c-13.414847 0-23.848617-11.924309-31.30131-35.772925l-114.77147 17.886463c-2.981077 0-4.471616-1.490539-4.471616-4.471616v-4.471616l1.490539-55.149927c0-2.981077 1.490539-5.962154 4.471615-7.452693l70.055313-32.791849 22.358079-10.43377V819.796215c-5.962154-58.131004-10.43377-134.148472-14.905386-225.071324l-46.206696 13.414847h-4.471615l-19.377002 4.471616c-87.941776 10.43377-222.090247 26.829694-295.126637 35.772925-20.86754 2.981077-35.772926 4.471616-44.716158 4.471616-23.848617 2.981077-25.339156-26.829694-7.452692-37.263464 2.981077-1.490539 56.640466-29.810771 123.714701-67.074236v-38.754003c0-14.905386 11.924309-26.829694 26.829695-26.829694s26.829694 11.924309 26.829694 26.829694v8.943232c40.244541-20.86754 81.979622-43.225619 119.243086-64.093159v-44.716157c0-14.905386 11.924309-26.829694 26.829694-26.829695s26.829694 11.924309 26.829694 26.829695v14.905385c23.848617-11.924309 43.225619-23.848617 56.640466-31.30131-1.490539-174.393013 11.924309-308.541485 61.112082-332.390101 2.981077-1.490539 4.471616-1.490539 7.452693-2.981078 1.490539 0 4.471616 0 5.962154-1.490538h5.962154c1.490539 0 4.471616 0 5.962154 1.490538 2.981077 0 4.471616 1.490539 7.452693 2.981078 49.187773 23.848617 62.60262 157.997089 58.131005 332.390101 13.414847 7.452693 32.791849 17.886463 55.149927 29.810772v-14.905386c0-14.905386 11.924309-26.829694 26.829694-26.829694s26.829694 11.924309 26.829695 26.829694v44.716157c37.263464 20.86754 78.998544 43.225619 119.243085 65.583698V506.783115c0-14.905386 11.924309-26.829694 26.829695-26.829694s26.829694 11.924309 26.829694 26.829694v44.716157c68.564774 37.263464 122.224163 67.074236 123.714702 68.564775 25.339156 10.43377 23.848617 41.73508-1.490539 38.754002z",
          color: "white",
          symbolSize: 20,
        },
      },
    ],
  });
});
</script>

<style scoped lang="scss">
.map {
  width: 100%;
  flex: 3;
  font: normal 400 14px/14px "Microsoft Yahei";
  color: rgb(233, 226, 226);
  .warn {
    position: absolute;
    top: 64px;
    left: 50%;
    margin: 14px -311px;
    width: 622px;
    height: 44px;
    text-align: center;
    line-height: 44px;
    background: url("../../../../images/dataScreen-header-warn-bg.png")
      no-repeat;
  }
  .tour {
    position: absolute;
    top: 112px;
    width: 200px;
    height: 25px;
    padding-left: 32px;
    margin-top: 40px;
    margin-left: 36px;
    font-size: 16px;
    line-height: 24px;
    background: url("../../../../images/map-title-bg.png") no-repeat;
    background-size: cover;
  }
  .echartsMap {
    width: 100%;
    height: 100%;
  }
}
</style>